Revit 2024 API
EnergyAnalysisWindowType.WindowTypeName Property
 The name of the window type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public string WindowTypeName { get; }
Visual Basic
Public ReadOnly Property WindowTypeName As String
	Get
Visual C++
public:
property String^ WindowTypeName {
	String^ get ();
}
See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace